### Pandas

- It is an open source library built on the top of the Numpy
- It allows for analysis and data cleaning and preparation.
- It is basically used for reading the data.The data can be any format(csv,excel,json,etc)
- It also has built-in visulization features.   

## installation 
- pip install pandas

## Series in Pandas

In [49]:
import numpy as np
import pandas as pd

In [50]:
l = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [51]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

- In series the first element is the value and the second variable is for indexing.
- like in below code the l is used for providing the index and my_data will provide the values

In [52]:
pd.Series(my_data,l)

a    10
b    20
c    30
dtype: int64

In [53]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [54]:
se = pd.Series(data = ['India','USA','UAE'],index = [1,2,3])

In [55]:
se[1]

'India'

In [56]:
se+se

1    IndiaIndia
2        USAUSA
3        UAEUAE
dtype: object

### Pandas DataFrame

In [57]:
from numpy.random import randn

In [58]:
np.random.seed(101)

In [59]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['Q','W','R','T'])
df

          Q         W         R         T
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df['W']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [61]:
df.W

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [62]:
type(df['Q'])

pandas.core.series.Series

In [63]:
df[['Q','T']]

          Q         T
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [64]:
df['new'] = df['W']+df['Q'] # adding a new column to the dataframe
df

          Q         W         R         T       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [65]:
df.drop('new',axis=1,inplace=True) # droping the column from the dataframe

In [66]:
df

          Q         W         R         T
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df.drop('E',axis=0) # droping the row

          Q         W         R         T
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [68]:
df.shape

(5, 4)

In [69]:
df.loc['A'] # accessing all the Columns value regarding the specified row name

Q    2.706850
W    0.628133
R    0.907969
T    0.503826
Name: A, dtype: float64

In [70]:
df.iloc[2] # accessing all the columns value regarding to specified row index

Q   -2.018168
W    0.740122
R    0.528813
T   -0.589001
Name: C, dtype: float64

In [71]:
df.loc['B','W']

-0.31931804459303326

In [72]:
df.loc[['A','B'],['Q','W']]

          Q         W
A  2.706850  0.628133
B  0.651118 -0.319318

In [73]:
df>0 # creating a boolean dataframe

       Q      W      R      T
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [74]:
bool_df = df > 0 # in this the value which are less than 0 will shown as NaN.
df[bool_df]

          Q         W         R         T
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
# Index Levels
outside = ['g1','g1','g1','g2','g2','g2'] # this whole code is present in jupyter notebook
inside = [1,2,3,1,2,3]
hier = list(zip(outside,inside))
hier = pd.MultiIndex.from_tuples(hier)
hier

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

# Creating Multilevel Index

In [76]:
dff = pd.DataFrame(randn(6,2),hier,['A','B'])
dff

             A         B
g1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
g2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

#### Accessing the element from multi-index dataframe

In [77]:
dff.loc['g1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [78]:
dff.loc['g1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [79]:
df.index.names # this will None because there is no name for the columns

FrozenList([None])

### creating the columns name for the columns

In [80]:
dff.index.names = ['Group','Num']

In [81]:
dff

                  A         B
Group Num
g1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
g2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

- Selecting the value from g2 group from 2 num with B column

In [82]:
dff.loc['g2'].loc[2]['B']

0.07295967531703869

- Selecting the value from g1 group from 3 num with A column

In [83]:
dff.loc['g1'].loc[3]['A']

-0.13484072060601238

In [84]:
dff.loc['g1']

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

Cross Section (xs) - this will print the data same as loc function prints

In [85]:
dff.xs('g1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

Advance version of cross section.

In [86]:
dff.xs(1,level='Num')

              A         B
Group
g1     0.302665  1.693723
g2     0.166905  0.184502

In [87]:
dff.xs('g1',level='Group')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

# Missing Data

In [88]:
# create data frame

d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[3,4,5]}

In [89]:
ddf = pd.DataFrame(d)
ddf

     A    B  C
0  1.0  5.0  3
1  2.0  NaN  4
2  NaN  NaN  5

In [90]:
ddf.dropna()

     A    B  C
0  1.0  5.0  3

In [91]:
ddf.dropna(axis=1)

   C
0  3
1  4
2  5

In [92]:
ddf.dropna(thresh=2) # thresh function is used to print the row which has atleast 2 non none value

     A    B  C
0  1.0  5.0  3
1  2.0  NaN  4

Now fill the nan value

In [93]:
ddf.fillna(value = 'A')

     A    B  C
0  1.0  5.0  3
1  2.0    A  4
2    A    A  5

# Group By

- It allows us to group together rows based off of a column and perform an aggregate function on them.

In [94]:
dic = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [95]:
tf = pd.DataFrame(dic)
tf

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [96]:
a = tf.groupby('Company')
a.mean()

TypeError: Could not convert CarlSarah to numeric

In [ ]:
a.sum().loc['FB']

C:\Users\anuku\AppData\Local\Temp\ipykernel_25324\1016092093.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  a.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [ ]:
tf.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
tf.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [ ]:
tf.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging Joining and concatenating data-frame

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Conactinating all 3 dataframe

In [ ]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [ ]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [ ]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operation in Pandas

In [ ]:
d = pd.DataFrame({'col1':[1,2,3,4],
     'col2':[444,555,666,444],
     'col3':['abc','def','ghi','xyz']})

In [ ]:
d.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
d['col1'].unique() # this will print the list of unique value

array([1, 2, 3, 4], dtype=int64)

In [ ]:
len(d['col2'].unique())

3

In [ ]:
d['col2'].nunique() # print the number of unique value

3

In [ ]:
d['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
d.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
d.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
d.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi